meeting/agenda/2025/09-30.org
:PROPERTIES:
:ID:       7BC9FD3A-0FBD-4454-A907-6B3165377627
:END:
#+title: QT4 CG Meeting 136 Agenda 2025-09-30
#+author: Norm Tovey-Walsh
#+filetags: :qt4cg:
#+options: html-style:nil h:6 toc:nil
#+html_head: <link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
#+html_head: <link rel="shortcut icon" href="/img/QT4-64.png" />
#+html_head: <link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
#+options: author:nil email:nil creator:nil timestamp:nil
#+startup: showall

[[../][Agenda index]] / [[https://qt4cg.org][QT4CG.org]] / [[https://qt4cg.org/dashboard][Dashboard]] / [[https://github.com/qt4cg/qtspecs/issues][GH Issues]] / [[https://github.com/qt4cg/qtspecs/pulls][GH Pull Requests]]

* Agenda
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: agenda
:END:

This meeting will be hosted on Zoom at 16:00BST (15:00GMT, 17:00CEST, 11:00EDT).

The [[https://us06web.zoom.us/j/83199966275?pwd=SmN6V0RhUGdSTHFHZkd6cjgxVEY2QT09][Zoom meeting]] ID is 831 9996 6275; the passcode is 707664.

See the [[https://qt4cg.org/meeting/logistics.html][meeting logistics]] page for more details.

* Administrivia
:PROPERTIES:
:CUSTOM_ID: administrivia
:END:

** Roll call
:PROPERTIES:
:CUSTOM_ID: roll-call
:END:

** Approve the agenda
:PROPERTIES:
:CUSTOM_ID: accept-agenda
:END:

** Approve minutes of previous meeting
:PROPERTIES:
:CUSTOM_ID: approve-minutes
:END:

Minutes of [[../../minutes/2025/09-23.html][the previous meeting]].

** Next meeting
:PROPERTIES:
:CUSTOM_ID: next-meeting
:END:

This meeting is planned for 30 September 2025.

The next meeting is planned for 7 October 2025.

** Review of open action items [0/9]
:PROPERTIES:
:CUSTOM_ID: open-actions
:END:

(Items marked [X] are believed to have been closed via email before
this agenda was posted.)

+ [ ] QT4CG-116-01: Add a specific error code for unsupported options on doc and doc-available
+ [ ] QT4CG-118-01: MK to make an incorrect type raise an error in #1906
+ [ ] QT4CG-127-01: NW to diagram the JTree representing arbitrary XDM content.
+ [ ] QT4CG-128-03: NW to compare the file: module against the equivalent XProc 3.1 steps
+ [ ] QT4CG-131-01: MK to add a non-schema aware result.
+ [ ] QT4CG-131-02: MK to expand on the ~$E := <e A="p q r"…~ example
+ [ ] QT4CG-131-03: MK to change “invert” to “transpose” in the matrix example.
+ [ ] QT4CG-133-01: MK to correct the use of “Expr” in examples for get()
+ [ ] QT4CG-135-01: MK to correct attribute rule 5/d to use the schema component name

** Review of open pull requests and issues
:PROPERTIES:
:CUSTOM_ID: open-pull-requests
:END:

This section summarizes all of the issues and pull requests that need to be
resolved before we can finish. See [[#technical-agenda][Technical Agenda]] below for the focus of this
meeting.

*** Blocked
:PROPERTIES:
:CUSTOM_ID: blocked
:END:

The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.

+ PR [[https://qt4cg.org/dashboard/#pr-2124][#2124]]: 573 Functions to Construct Trees
+ PR [[https://qt4cg.org/dashboard/#pr-2120][#2120]]: 2007 Revised design for xsl:array
+ PR [[https://qt4cg.org/dashboard/#pr-2019][#2019]]: 1776: XSLT template rules for maps and array

*** Merge without discussion
:PROPERTIES:
:CUSTOM_ID: merge-without-discussion
:END:

The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.

+ PR [[https://qt4cg.org/dashboard/#pr-2212][#2212]]: 1980 Use HTML5-defined syntax for meta element
+ PR [[https://qt4cg.org/dashboard/#pr-2207][#2207]]: 2196 Clarify XQST0070
+ PR [[https://qt4cg.org/dashboard/#pr-2206][#2206]]: 2204 Change method call expansion so error code becomes XPTY0004

*** Close without action
:PROPERTIES:
:CUSTOM_ID: close-without-action
:END:

It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/1965][#1965]]: The Generator record
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1452][#1452]]: Links from the agendas/minutes to the dashboard don't redirect when the PR is no longer on the dashboard
+ Issue [[https://github.com/qt4cg/qtspecs/issues/716][#716]]: Generators in XPath
+ Issue [[https://github.com/qt4cg/qtspecs/issues/708][#708]]: Toward a design for generators

*** Substantive PRs
:PROPERTIES:
:CUSTOM_ID: substantive
:END:

The following substantive PRs were open when this agenda was prepared.

(Note: this /is not/ the proposed order for discussion, see [[#technical-agenda][Technical agenda]] below.)

+ PR [[https://qt4cg.org/dashboard/#pr-2213][#2213]]: 2047 External resources and security
+ PR [[https://qt4cg.org/dashboard/#pr-2211][#2211]]: 2210 Drop parse-html include-template-content option
+ PR [[https://qt4cg.org/dashboard/#pr-2209][#2209]]: 2165 Rephrase semantics of treat-as
+ PR [[https://qt4cg.org/dashboard/#pr-2208][#2208]]: 675 (part) Update XSLT streamability rules
+ PR [[https://qt4cg.org/dashboard/#pr-2205][#2205]]: 2190 Drop binary input for parse-csv and parse-json
+ PR [[https://qt4cg.org/dashboard/#pr-2160][#2160]]: 2073 data model changes for JNodes and Sequences
+ PR [[https://qt4cg.org/dashboard/#pr-2123][#2123]]: 2051: XSLT group by cluster
+ PR [[https://qt4cg.org/dashboard/#pr-2120][#2120]]: 2007 Revised design for xsl:array
+ PR [[https://qt4cg.org/dashboard/#pr-2071][#2071]]: 77c deep update
+ PR [[https://qt4cg.org/dashboard/#pr-2019][#2019]]: 1776: XSLT template rules for maps and array

*** Required for V4.0
:PROPERTIES:
:CUSTOM_ID: required-40
:END:

The following issues are labeled “required for V4.0”.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/1777][#1777]]: Shallow copy in XSLT with maps and arrays
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1584][#1584]]: Review the XML Schema and RELAX NG schemas for XSLT 4.0 for compatibility
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1045][#1045]]: Functions to manage namespace usage
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1011][#1011]]: fn:transform() improvements
+ Issue [[https://github.com/qt4cg/qtspecs/issues/986][#986]]: Numeric Comparisons
+ Issue [[https://github.com/qt4cg/qtspecs/issues/675][#675]]: XSLT streaming rules for new constructs
+ Issue [[https://github.com/qt4cg/qtspecs/issues/407][#407]]: XSLT-specific context properties used in function items
+ Issue [[https://github.com/qt4cg/qtspecs/issues/272][#272]]: Setting parameter values in xsl:use-package

* Technical agenda
:PROPERTIES:
:CUSTOM_ID: technical-agenda
:END:

** PR #2123: 2051: XSLT group by cluster
:PROPERTIES:
:CUSTOM_ID: pr-2123
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2123][#2123]].

** PR #2211: 2210 Drop parse-html include-template-content option
:PROPERTIES:
:CUSTOM_ID: pr-2211
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2211][#2211]].

** PR #2209: 2165 Rephrase semantics of treat-as
:PROPERTIES:
:CUSTOM_ID: pr-2209
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2209][#2209]].

** PR #2205: 2190 Drop binary input for parse-csv and parse-json
:PROPERTIES:
:CUSTOM_ID: pr-2205
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2205][#2205]].

** PR #2213: 2047 External resources and security
:PROPERTIES:
:CUSTOM_ID: pr-2213
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2213][#2213]].

** PR #2160: 2073 data model changes for JNodes and Sequences
:PROPERTIES:
:CUSTOM_ID: pr-2160
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2160][#2160]].

** PR #2208: 675 (part) Update XSLT streamability rules
:PROPERTIES:
:CUSTOM_ID: pr-2208
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2208][#2208]].

** PR #2120: 2007 Revised design for xsl:array
:PROPERTIES:
:CUSTOM_ID: pr-2120
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2120][#2120]].

** PR #2019: 1776: XSLT template rules for maps and array
:PROPERTIES:
:CUSTOM_ID: pr-2019
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2019][#2019]].


* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:

